Revit 2024 API
FloorType.StructuralMaterialId Property
 Returns the identifier of the material that defines the element's structural analysis properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId StructuralMaterialId { get; set; }
Visual Basic
Public Property StructuralMaterialId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ StructuralMaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: the floor does not have a structural material
See Also
FloorType Class
Autodesk.Revit.DB Namespace